#### Terraform Format and Style - PROD 🖌`success`
#### Terraform Initialization - PROD ⚙️`success`
#### Terraform Validation - PROD 🤖`success`
#### Terraform Plan - PROD 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
aws_vpc.lou: Refreshing state... [id=vpc-0995d24bec54d0bff]
aws_subnet.subnet-public["sub-c"]: Refreshing state... [id=subnet-0a2471df1913a6df8]
aws_subnet.subnet-db-private["sub-c"]: Refreshing state... [id=subnet-0ac4594bb6deae8b4]
aws_subnet.subnet-db-private["sub-a"]: Refreshing state... [id=subnet-0c9b0ea420c350c32]
aws_subnet.subnet-public["sub-a"]: Refreshing state... [id=subnet-084031a7835034998]
aws_subnet.subnet-public["sub-b"]: Refreshing state... [id=subnet-03d9718ffba106bc2]
aws_route_table.private-rt: Refreshing state... [id=rtb-07a6d966e0b8b1453]
aws_subnet.subnet-db-private["sub-b"]: Refreshing state... [id=subnet-06554508c1516e33a]
aws_internet_gateway.lou-igw: Refreshing state... [id=igw-0a49d4d25c2a0592f]
aws_subnet.subnet-web-private["sub-a"]: Refreshing state... [id=subnet-02a7715cf9ffba647]
aws_subnet.subnet-web-private["sub-c"]: Refreshing state... [id=subnet-0fc7e46f1ccd56fc4]
aws_subnet.subnet-web-private["sub-b"]: Refreshing state... [id=subnet-01305280edf3796ca]
aws_route_table.public-rt: Refreshing state... [id=rtb-0420af2a5459c3980]
aws_route_table_association.web-private["sub-b"]: Refreshing state... [id=rtbassoc-04f99d123d0234c30]
aws_route_table_association.web-private["sub-c"]: Refreshing state... [id=rtbassoc-045bf088f73ea2cb2]
aws_route_table_association.web-private["sub-a"]: Refreshing state... [id=rtbassoc-0e713decb9be20bd8]
aws_route_table_association.db-private["sub-b"]: Refreshing state... [id=rtbassoc-0ac48eadcf55d5330]
aws_route_table_association.db-private["sub-a"]: Refreshing state... [id=rtbassoc-01b43d5b721fb2cbd]
aws_route_table_association.db-private["sub-c"]: Refreshing state... [id=rtbassoc-01fd1dc4e670dec4f]
aws_route_table_association.public["sub-b"]: Refreshing state... [id=rtbassoc-034f01e90df2b544d]
aws_route_table_association.public["sub-c"]: Refreshing state... [id=rtbassoc-0c047cd14aa1be65f]
aws_route_table_association.public["sub-a"]: Refreshing state... [id=rtbassoc-0e0853c6c5d4bdb1f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.private_http_https will be created
  + resource "aws_security_group" "private_http_https" {
      + arn                    = (known after apply)
      + description            = "Allow 80, 443 inbound traffic from ALB-SG"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "HTTP from ALB-SG"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = []
              + description      = "HTTPS from ALB-SG"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "private_http_https"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "private_http_https"
        }
      + tags_all               = {
          + "Name" = "private_http_https"
        }
      + vpc_id                 = "vpc-0995d24bec54d0bff"
    }

  # aws_security_group.private_mysql will be created
  + resource "aws_security_group" "private_mysql" {
      + arn                    = (known after apply)
      + description            = "Allow port 3306 inbound traffic from private_http_https"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "HTTPS from private_http_https"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 3306
            },
        ]
      + name                   = "private_mysql"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "private_mysql"
        }
      + tags_all               = {
          + "Name" = "private_mysql"
        }
      + vpc_id                 = "vpc-0995d24bec54d0bff"
    }

  # aws_security_group.public_http_https will be created
  + resource "aws_security_group" "public_http_https" {
      + arn                    = (known after apply)
      + description            = "Allow 80, 443 inbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP from internet"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS from internet"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "public_http_https"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "public_http_https"
        }
      + tags_all               = {
          + "Name" = "public_http_https"
        }
      + vpc_id                 = "vpc-0995d24bec54d0bff"
    }

  # aws_security_group.public_ssh will be created
  + resource "aws_security_group" "public_ssh" {
      + arn                    = (known after apply)
      + description            = "Allow SSH port 22 inbound traffic from My IP"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "202.142.36.143/32",
                ]
              + description      = "SSH port 22 inbound from My IP"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "public_ssh"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "public_ssh"
        }
      + tags_all               = {
          + "Name" = "public_ssh"
        }
      + vpc_id                 = "vpc-0995d24bec54d0bff"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>
*Pushed by: @NgaNaNa, Action: `pull_request`*